export interface GateMessage {
  id: number;
  title: string;
  message: string;
  whisper: string;
}

export const gateMessages: GateMessage[] = [
  {
    id: 1,
    title: "প্রথম অনুভব",
    message: "প্রথম যেদিন তোমাকে লক্ষ্য করেছিলাম, জানি না কেন মনে হয়েছিল তুমি অন্য সবার মতো নও। তোমার মধ্যে এমন একটা calmness আছে, যেটা খুব সহজে চোখে পড়ে না, কিন্তু মনে থেকে যায়।",
    whisper: "Some people are noticed by eyes, but remembered by heart."
  },
  {
    id: 2,
    title: "তোমার হাসি",
    message: "তোমার হাসির মধ্যে একটা অদ্ভুত শান্তি আছে। খুব simple একটা smile, কিন্তু আমার পুরো দিনটা সুন্দর করে দেওয়ার মতো ক্ষমতা রাখে।",
    whisper: "তোমার smile টা হয়তো ছোট, কিন্তু আমার কাছে সেটা অনেক বড় একটা feeling।"
  },
  {
    id: 3,
    title: "ছোট ছোট ব্যাপার",
    message: "তোমার কথা বলার ভঙ্গি, তোমার simplicity, তোমার ছোট ছোট অভ্যাস সবকিছু মিলেই তুমি আমার কাছে খুব special হয়ে উঠেছো। তোমার খুব সাধারণ কিছু জিনিসও আমার কাছে অসাধারণ লাগে।😊",
    whisper: "Sometimes little things create the deepest feelings."
  },
  {
    id: 4,
    title: "না বলা কথা",
    message: "আমার মতো ভিতু মানুষ হয়তো কোনোদিন সাহস করে তোমার সামনে দাঁড়িয়ে মনের কথাগুলো বলতে পারত না। অনেক কথা আছে, যেগুলো মুখে বলতে গেলে ভয় লাগে, গলা আটকে যায়, শব্দগুলো ঠিকমতো বের হয় না। কেন জানি তুমি সামনে আসলে সব কিছুই উলট পালট হয়ে যায়। তাই এই ছোট্ট website টা বানালাম, যেন আমার না বলা কথাগুলো তুমি অনুভব করতে পারো। এখানে প্রতিটা শব্দ, প্রতিটা লাইন, প্রতিটা ছোট্ট মনের কথা সবকিছুই শুধু তোমাকে বোঝানোর জন্য, আমার মনের অনুভূতিগুলো কতটা সত্যি, কতটা sincere। হয়তো আমি মুখে বলতে পারি না, কিন্তু এই website এর প্রতিটা অংশে আমি আমার মনের সবটুকু সাহস রেখে দিয়েছি শুধু তোমার জন্য।",
    whisper: "Words may be small, but feelings are not."
  },
  {
    id: 5,
    title: "একটা Respectful Promise",
    message: "আমি perfect মানুষ নাও হতে পারি, কিন্তু আমি সবসময় তোমাকে respect করতে, care করতে, আর তোমার পাশে honest ভাবে থাকতে চাই।",
    whisper: "Love should feel peaceful, not complicated."
  },
  {
    id: 6,
    title: "শেষ দরজার আগে",
    message: "এই journey এর প্রতিটা দরজা আসলে আমার মনের একটা করে না বলা কথা। প্রতিটা পেজ, প্রতিটা লাইন, প্রতিটা ছোট্ট ইশারা সবকিছুই শুধু তোমাকে বোঝানোর চেষ্টা করেছে, তুমি আমার কাছে কতটা আলাদা।তুমি সেই অনুভূতি, যেটা হঠাৎ করে মন ভালো করে দেয়, চুপচাপ থেকেও যার কথা সব সময় মনে পড়ে, আর যার উপস্থিতি না থাকলেও মনে হয়, কেউ একজন খুব আপন হয়ে আছে। এই পুরো journey টা আসলে তোমার জন্য আমার মনের সবচেয়ে নরম, সবচেয়ে সত্য কথাগুলোর একটা ছোট্ট প্রকাশ। কারণ তুমি আমার কাছে শুধু একটা পছন্দ নও, তুমি আমার মনের সবচেয়ে সুন্দর অনুভূতিগুলোর মধ্যে একটা, যাকে আমি খুব যত্ন করে অনুভব করি।",
    whisper: "আর শেষ দরজার ওপারে আছে সেই প্রশ্নটা…"
  }
];
